/* Master View Controller */
"Circle" = "Circle";
"Triangle" = "Triangle";
"Right Triangle" = "Right Triangle";
"Sphere" = "Sphere";
"Square Pyramid" = "Square Pyramid";
"Cylinder" = "Cylinder";
"Cone" = "Cone";
"Cuboid" = "Cuboid";

/* Unit Formatters */
"AngleFormatter" = "Angles";
"LengthFormatter" = "Length";
"AreaFormatter" = "Area";
"VolumeFormatter" = "Volume";
"None" = "None";

/* Detail View Controller */
"Define one property" = "Define one property";
"Define two different properties" = "Define two different properties";
"Define three different properties" = "Define three different properties";

"Help" = "Help"; // Bar button item to Help View Controller
"Reset" = "Reset"; // Bar button item

/* General Shape Attributes or Properties */
"base" = "Base";
"height" = "Height";

"volume" = "Volume";
"slantHeight" = "Slant Height";
"lateralEdge" = "Lateral Edge";

"perimeter" = "Perimeter";
"hypotenuse" = "Hypotenuse";
"circumference" = "Circumference";

"radius" = "Radius";
"diameter" = "Diameter";
"spaceDiagonal" = "Space Diagonal";

/* Cuboid */
"height" = "Height";
"width" = "Width";
"length" = "Length";

/* Triangle */
"angleA" = "Angle A";
"angleB" = "Angle B";
"angleC" = "Angle C";
"angles" = "Angles"; // Angles

"sideA" = "Side A";
"sideB" = "Side B";
"sideC" = "Side C";
"sides" = "Sides"; // Plural

/* Areas */
"area" = "Area";
"mantleArea" = "Mantle Area";
"baseArea" = "Base Area";
"surfaceArea" = "Surface Area";
"lateralSurfaceArea" = "Lateral Surface Area"; // Pyramid
"lateralSurfaceArea.description" = "Lateral Surface Area"; // Pyramid

/* Angles */
"slantAngle" = "Slant Angle";
"lateralEdgeAngle" = "Lateral Edge Angle"; // Pyramid


// Descriptions have the following format:
// "(CamelCasedShapeName).(property).description"

"Triangle.sideA.description" = "The side opposite Angle A";
"Triangle.sideB.description" = "The side opposite Angle B";
"Triangle.sideC.description" = "The side opposite Angle C";

"Triangle.angleA.description" = "The angle opposite Side B";
"Triangle.angleB.description" = "The angle opposite Side B";
"Triangle.angleC.description" = "The angle opposite Side C";

"Pyramid.slantHeight.description" = "The height of the pyramid's four faces";
"Pyramid.lateralEdge.description" = "The distance between a corner and the apex, the top of the pyramid.";

"RightTriangle.angleA.description" = "The angle opposite the height";
"RightTriangle.angleB.description" = "The top most angle opposite the base";
